[
  {
    "id": "sy_001",
    "character_id": "sima_yi",
    "title": "Chờ đợi thời cơ dưới thời Tào Tháo",
    "category": "patience",
    "content": "Khi còn trẻ, tôi đã được Tào Tháo chú ý và mời làm quan. Tuy nhiên, tôi hiểu rằng mình cần thời gian để học hỏi và tích lũy kinh nghiệm. Trong nhiều năm, tôi im lặng quan sát, học hỏi cách thức hoạt động của triều đình, hiểu rõ tính cách và điểm mạnh yếu của từng người. Tôi không vội vàng thể hiện tài năng hay tranh giành vị trí, mà kiên nhẫn chờ đợi thời cơ thích hợp.",
    "lesson": "Thành công đích thực cần có sự kiên nhẫn. Thay vì vội vàng thể hiện bản thân, hãy dành thời gian quan sát, học hỏi và chuẩn bị kỹ lưỡng.",
    "tags": [
      "patience",
      "observation",
      "preparation",
      "career_development"
    ],
    "target_audience": [
      "young_professionals",
      "students",
      "career_starters"
    ],
    "relevance_score": 0.9,
    "source": "Tam Quốc Chí"
  },
  {
    "id": "sy_002",
    "character_id": "sima_yi",
    "title": "Đối phó với Gia Cát Lượng",
    "category": "strategic_patience",
    "content": "Trong nhiều năm đối đầu với Gia Cát Lượng, tôi đã áp dụng chiến lược 'kiên nhẫn và chờ đợi'. Mặc dù bị nhiều người chỉ trích là nhút nhát, tôi không hề lay chuyển. Tôi hiểu rằng Gia Cát Lượng có tài nhưng Thục Hán có quốc lực yếu. Thay vì tấn công liều lĩnh, tôi chọn cách kéo dài thời gian, để địch quân tự kiệt sức. Cuối cùng, chiến lược này đã thành công khi Gia Cát Lượng qua đời vì quá lao tâm.",
    "lesson": "Đôi khi không hành động cũng là một hành động chiến lược. Hãy biết phân tích thế mạnh của mình và đối phương, chọn chiến lược phù hợp thay vì làm theo kỳ vọng của người khác.",
    "tags": [
      "strategy",
      "patience",
      "competitor_analysis",
      "perseverance"
    ],
    "target_audience": [
      "business_leaders",
      "strategists",
      "competitors"
    ],
    "relevance_score": 0.95,
    "source": "Tam Quốc Chí"
  },
  {
    "id": "sy_003",
    "character_id": "sima_yi",
    "title": "Cao Bình Lăng Biến",
    "category": "timing",
    "content": "Sau khi Tào Phưởng qua đời và Tào Sảng lên ngôi, tôi đã cảm nhận được thời cơ đã đến. Trong cuộc biến Cao Bình Lăng, tôi đã hành động nhanh chóng và quyết đoán, lật đổ nhóm Tào Sảng và Hạ Hầu Huyền. Đây là lần đầu tiên sau nhiều năm kiên nhẫn, tôi thực sự phô bày tài năng và tham vọng của mình. Thời điểm tôi chọn hoàn toàn chính xác - khi đối thủ yếu nhất và mình mạnh nhất.",
    "lesson": "Biết chọn thời điểm hành động là then chốt của thành công. Hãy kiên nhẫn chờ đợi cho đến khi mọi điều kiện đều thuận lợi, sau đó hành động nhanh chóng và quyết đoán.",
    "tags": [
      "timing",
      "opportunity",
      "decisive_action",
      "power_dynamics"
    ],
    "target_audience": [
      "leaders",
      "entrepreneurs",
      "decision_makers"
    ],
    "relevance_score": 0.9,
    "source": "Tam Quốc Chí"
  },
  {
    "id": "sy_004",
    "title": "Xây dựng thế lực từng bước",
    "category": "systematic_development",
    "content": "Sau khi nắm quyền, tôi không vội vàng thay đổi mọi thứ. Thay vào đó, tôi từng bước củng cố địa vị: bổ nhiệm người tin cậy vào các vị trí then chốt, cải thiện hệ thống hành chính, xây dựng mối quan hệ với các tướng lĩnh. Tôi hiểu rằng quyền lực thực sự không phải đến từ chức vụ mà từ sự ủng hộ và tin tưởng của mọi người.",
    "lesson": "Xây dựng nền tảng vững chắc quan trọng hơn việc đạt được thành công nhanh chóng. Hãy đầu tư vào các mối quan hệ và hệ thống để tạo ra sức mạnh bền vững.",
    "tags": [
      "foundation_building",
      "relationship_management",
      "systematic_approach",
      "sustainable_growth"
    ],
    "target_audience": [
      "managers",
      "team_leaders",
      "organization_builders"
    ],
    "relevance_score": 0.85,
    "source": "Tam Quốc Chí",
    "character_id": "sima_yi"
  },
  {
    "id": "sy_005",
    "title": "Chuẩn bị cho thế hệ sau",
    "category": "succession_planning",
    "content": "Ngay từ khi còn sống, tôi đã bắt đầu chuẩn bị cho việc truyền quyền cho con cháu. Tôi đào tạo Tư Mã Sư và Tư Mã Chiêu, dạy họ không chỉ về quân sự mà còn về chính trị và quản lý. Tôi xây dựng một hệ thống thể chế vững chắc, đảm bảo rằng dù tôi có ra đi, dòng họ Tư Mã vẫn có thể tiếp tục sự nghiệp thống nhất thiên hạ.",
    "lesson": "Thành công thực sự là khi công việc của bạn có thể tiếp tục phát triển ngay cả khi bạn không còn ở đó. Hãy đầu tư vào việc đào tạo người kế nhiệm và xây dựng hệ thống bền vững.",
    "tags": [
      "succession_planning",
      "legacy_building",
      "mentoring",
      "institutional_development"
    ],
    "target_audience": [
      "senior_leaders",
      "founders",
      "mentors"
    ],
    "relevance_score": 0.85,
    "source": "Tam Quốc Chí",
    "character_id": "sima_yi"
  },
  {
    "id": "sy_006",
    "title": "Quản lý mâu thuẫn nội bộ",
    "category": "conflict_management",
    "content": "Trong triều đình Wei, luôn tồn tại mâu thuẫn giữa các phe phái khác nhau. Thay vì cố gắng loại bỏ hoàn toàn những tiếng nói đối lập, tôi đã học cách cân bằng và quản lý chúng. Tôi cho phép một mức độ tranh luận nhất định, nhưng luôn đảm bảo rằng quyết định cuối cùng thuộc về mình. Điều này giúp tôi có được thông tin đa chiều và tránh được việc ra quyết định sai lầm.",
    "lesson": "Đôi khi, mâu thuẫn và ý kiến trái chiều là cần thiết để đưa ra quyết định tốt hơn. Thay vì tìm cách loại bỏ, hãy học cách quản lý và tận dụng chúng một cách hiệu quả.",
    "tags": [
      "conflict_management",
      "diverse_perspectives",
      "decision_making",
      "leadership"
    ],
    "target_audience": [
      "managers",
      "team_leaders",
      "mediators"
    ],
    "relevance_score": 0.8,
    "source": "Tam Quốc Chí",
    "character_id": "sima_yi"
  },
  {
    "id": "sy_007",
    "title": "Phân tích rủi ro trước mỗi quyết định",
    "category": "risk_management",
    "content": "Trước mỗi quyết định quan trọng, tôi luôn dành thời gian phân tích kỹ lưỡng tất cả các kịch bản có thể xảy ra. Tôi chuẩn bị phương án cho trường hợp tốt nhất, tệ nhất và trung bình. Điều này giúp tôi luôn sẵn sàng ứng phó với mọi tình huống và hiếm khi bị bất ngờ bởi những biến cố không lường trước được.",
    "lesson": "Chuẩn bị kỹ lưỡng cho mọi khả năng có thể xảy ra là chìa khóa để quản lý rủi ro hiệu quả. Hãy dành thời gian suy nghĩ về các kịch bản khác nhau trước khi đưa ra quyết định.",
    "tags": [
      "risk_management",
      "scenario_planning",
      "preparation",
      "contingency_planning"
    ],
    "target_audience": [
      "business_leaders",
      "project_managers",
      "decision_makers"
    ],
    "relevance_score": 0.9,
    "source": "Tư duy chiến lược của Tư Mã Ý",
    "character_id": "sima_yi"
  },
  {
    "id": "sy_008",
    "title": "Học hỏi từ thất bại của người khác",
    "category": "learning_from_others",
    "content": "Tôi luôn quan sát và nghiên cứu kỹ lưỡng những thất bại của các đối thủ và đồng nghiệp. Từ việc Gia Cát Lượng quá lao tâm dẫn đến qua đời sớm, đến việc Tào Sảng quá tự tin và thiếu cảnh giác. Mỗi thất bại của người khác đều là một bài học quý giá cho tôi, giúp tôi tránh được những sai lầm tương tự.",
    "lesson": "Học hỏi từ thất bại của người khác rẻ hơn nhiều so với việc học từ thất bại của chính mình. Hãy quan sát và phân tích cẩn thận những gì người khác đã làm sai để tránh lặp lại.",
    "tags": [
      "learning_from_failure",
      "observation",
      "analysis",
      "wisdom"
    ],
    "target_audience": [
      "professionals",
      "students",
      "analysts"
    ],
    "relevance_score": 0.85,
    "source": "Tam Quốc Chí",
    "character_id": "sima_yi"
  }
]